/*********************************************************************************************************
**
**                                    中国软件开源组织
**
**                                   嵌入式实时操作系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: ramFs.h
**
** 创   建   人: Han.Hui (韩辉)
**
** 文件创建日期: 2014 年 05 月 24 日
**
** 描        述: 内存文件系统.
*********************************************************************************************************/

#ifndef __SIMPLEFS_H
#define __SIMPLEFS_H

/*********************************************************************************************************
  裁剪宏
*********************************************************************************************************/
#if LW_CFG_MAX_VOLUMES > 0 && LW_CFG_RAMFS_EN > 0

/*********************************************************************************************************
  API
*********************************************************************************************************/
LW_API INT      API_SimpleFsDrvInstall(VOID);
LW_API INT      API_SimpleFsDevCreate(PCHAR   pcName, PLW_BLK_DEV  pblkd);
LW_API INT      API_SimpleFsDevDelete(PCHAR   pcName);

#define simpleFsDrv             API_SimpleFsDrvInstall
#define simpleFsDevCreate       API_SimpleFsDevCreate
#define simpleFsDevDelete       API_SimpleFsDevDelete

#endif                                                                  /*  LW_CFG_MAX_VOLUMES > 0      */
                                                                        /*  LW_CFG_RAMFS_EN > 0         */
#endif                                                                  /*  __RAMFS_H                   */
/*********************************************************************************************************
  END
*********************************************************************************************************/
